panel/classes/fedex/wsdl/Shipping_SampleTransactions/Cancel Pending Shipment (EmailLabel) (2).txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://fedex.com/ws/ship/v13"><SOAP-ENV:Body><ns1:CancelPendingShipmentRequest><ns1:WebAuthenticationDetail><ns1:UserCredential><ns1:Key>"Input Your Information"</ns1:Key><ns1:Password>"Input Your Information"</ns1:Password></ns1:UserCredential></ns1:WebAuthenticationDetail><ns1:ClientDetail><ns1:AccountNumber>"Input Your Information"</ns1:AccountNumber><ns1:MeterNumber>"Input Your Information"</ns1:MeterNumber></ns1:ClientDetail><ns1:TransactionDetail><ns1:CustomerTransactionId>*** CancelEMailLabel Request v13 ***</ns1:CustomerTransactionId></ns1:TransactionDetail><ns1:Version><ns1:ServiceId>ship</ns1:ServiceId><ns1:Major>13</ns1:Major><ns1:Intermediate>0</ns1:Intermediate><ns1:Minor>0</ns1:Minor></ns1:Version><ns1:TrackingId><ns1:TrackingIdType>EXPRESS</ns1:TrackingIdType><ns1:TrackingNumber>794814447640</ns1:TrackingNumber></ns1:TrackingId></ns1:CancelPendingShipmentRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>
